
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	_ДополнительнаяОбработкаОбъект = Параметры.ДополнительнаяОбработкаСсылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(_ДополнительнаяОбработкаОбъект,"ДополнительнаяОбработкаОбъект");
	КопироватьДанныеФормы(ОбщегоНазначения.ЗначениеИзСтрокиXML(
	_ДополнительнаяОбработкаОбъект.ХранилищеНастроек.Получить()),Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Модифицированность Тогда
		ТекущийОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(ОбщегоНазначения.ЗначениеВСтрокуXML(Объект));
	КонецЕсли;
КонецПроцедуры
